espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_dma_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif


/** Type of out_push register
 *  TX CHn outfifo push register
 */
typedef union {
    struct {
        /** outfifo_wdata : R/W; bitpos: [9:0]; default: 0;
         *  This register stores the data that need to be pushed into DMA Tx FIFO.
         */
        uint32_t outfifo_wdata: 10;
        /** outfifo_push : R/W/SC; bitpos: [10]; default: 0;
         *  Set this bit to push data into DMA Tx FIFO.
         */
        uint32_t outfifo_push: 1;
        uint32_t reserved_11: 21;
    };
    uint32_t val;
} h264_dma_out_push_chn_reg_t;

/** Type of out_link_conf register
 *  TX CHn out_link dscr ctrl register
 */
typedef union {
    struct {
        uint32_t reserved_0: 20;
        /** outlink_stop : R/W/SC; bitpos: [20]; default: 0;
         *  Set this bit to stop dealing with the outlink descriptors.
         */
        uint32_t outlink_stop: 1;
        /** outlink_start : R/W/SC; bitpos: [21]; default: 0;
         *  Set this bit to start dealing with the outlink descriptors.
         */
        uint32_t outlink_start: 1;
        /** outlink_restart : R/W/SC; bitpos: [22]; default: 0;
         *  Set this bit to restart a new outlink from the last address.
         */
        uint32_t outlink_restart: 1;
        /** outlink_park : RO; bitpos: [23]; default: 1;
         *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
         *  is working.
         */
        uint32_t outlink_park: 1;
        uint32_t reserved_24: 8;
    };
    uint32_t val;
} h264_dma_out_link_conf_chn_reg_t;

/** Type of in_conf0 register
 *  RX CHn config0 register
 */
typedef union {
    struct {
        uint32_t reserved_0: 2;
        /** indscr_burst_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
         *  when accessing SRAM.
         */
        uint32_t indscr_burst_en: 1;
        /** in_ecc_aes_en : R/W; bitpos: [3]; default: 0;
         *  When access address space is ecc/aes area, this bit should be set to 1. In this
         *  case, the start address of square should be 16-bit aligned. The width of square
         *  multiply byte number of one pixel should be 16-bit aligned.
         */
        uint32_t in_ecc_aes_en: 1;
        /** in_check_owner : R/W; bitpos: [4]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t in_check_owner: 1;
        uint32_t reserved_5: 1;
        /** in_mem_burst_length : R/W; bitpos: [8:6]; default: 0;
         *  Block size of Rx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64
         *  bytes    4: 128 bytes
         */
        uint32_t in_mem_burst_length: 3;
        uint32_t reserved_9: 3;
        /** in_page_bound_en : R/W; bitpos: [12]; default: 0;
         *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
         *  which define by mem_burst_length
         */
        uint32_t in_page_bound_en: 1;
        uint32_t reserved_13: 11;
        /** in_rst : R/W; bitpos: [24]; default: 0;
         *  Write 1 then write 0 to this bit to reset Rx channel
         */
        uint32_t in_rst: 1;
        /** in_cmd_disable : R/W; bitpos: [25]; default: 0;
         *  Write 1 before reset and write 0 after reset
         */
        uint32_t in_cmd_disable: 1;
        /** in_arb_weight_opt_dis : R/W; bitpos: [26]; default: 0;
         *  Set this bit to 1 to disable arbiter optimum weight function.
         */
        uint32_t in_arb_weight_opt_dis: 1;
        uint32_t reserved_27: 5;
    };
    uint32_t val;
} h264_dma_in_conf0_chn_reg_t;

/** Type of in_pop register
 *  RX CHn INFIFO pop register
 */
typedef union {
    struct {
        /** infifo_rdata : RO; bitpos: [10:0]; default: 1024;
         *  This register stores the data popping from DMA Rx FIFO.
         */
        uint32_t infifo_rdata: 11;
        /** infifo_pop : R/W/SC; bitpos: [11]; default: 0;
         *  Set this bit to pop data from DMA Rx FIFO.
         */
        uint32_t infifo_pop: 1;
        uint32_t reserved_12: 20;
    };
    uint32_t val;
} h264_dma_in_pop_chn_reg_t;

/** Type of in_link_conf register
 *  RX CHn in_link dscr ctrl register
 */
typedef union {
    struct {
        uint32_t reserved_0: 20;
        /** inlink_auto_ret : R/W; bitpos: [20]; default: 1;
         *  Set this bit to return to current inlink descriptor's address, when there are some
         *  errors in current receiving data.
         */
        uint32_t inlink_auto_ret: 1;
        /** inlink_stop : R/W/SC; bitpos: [21]; default: 0;
         *  Set this bit to stop dealing with the inlink descriptors.
         */
        uint32_t inlink_stop: 1;
        /** inlink_start : R/W/SC; bitpos: [22]; default: 0;
         *  Set this bit to start dealing with the inlink descriptors.
         */
        uint32_t inlink_start: 1;
        /** inlink_restart : R/W/SC; bitpos: [23]; default: 0;
         *  Set this bit to mount a new inlink descriptor.
         */
        uint32_t inlink_restart: 1;
        /** inlink_park : RO; bitpos: [24]; default: 1;
         *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
         *  working.
         */
        uint32_t inlink_park: 1;
        uint32_t reserved_25: 7;
    };
    uint32_t val;
} h264_dma_in_link_conf_chn_reg_t;

/** Type of in_ro_pd_conf register
 *  RX CHn reorder power config register
 */
typedef union {
    struct {
        uint32_t reserved_0: 6;
        /** in_ro_ram_clk_fo : R/W; bitpos: [6]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
         *  0: A gate-clock will be used when accessing the RAM in DMA.
         */
        uint32_t in_ro_ram_clk_fo: 1;
        uint32_t reserved_7: 25;
    };
    uint32_t val;
} h264_dma_in_ro_pd_conf_chn_reg_t;

