espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_dma_struct.h
/** Type of in_conf0_ch5 register
 *  RX CH5 config0 register
 */
typedef union {
    struct {
        uint32_t reserved_0: 3;
        /** in_ecc_aes_en : R/W; bitpos: [3]; default: 0;
         *  When access address space is ecc/aes area, this bit should be set to 1. In this
         *  case, the start address of square should be 16-bit aligned. The width of square
         *  multiply byte number of one pixel should be 16-bit aligned.
         */
        uint32_t in_ecc_aes_en: 1;
        uint32_t reserved_4: 2;
        /** in_mem_burst_length : R/W; bitpos: [8:6]; default: 0;
         *  Block size of Rx channel 1. 0: single      1: 16 bytes      2: 32 bytes    3: 64
         *  bytes    4: 128 bytes
         */
        uint32_t in_mem_burst_length: 3;
        uint32_t reserved_9: 3;
        /** in_page_bound_en : R/W; bitpos: [12]; default: 0;
         *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
         *  which define by mem_burst_length
         */
        uint32_t in_page_bound_en: 1;
        uint32_t reserved_13: 11;
        /** in_rst : R/W; bitpos: [24]; default: 0;
         *  Write 1 then write 0 to this bit to reset Rx channel
         */
        uint32_t in_rst: 1;
        /** in_cmd_disable : R/W; bitpos: [25]; default: 0;
         *  Write 1 before reset and write 0 after reset
         */
        uint32_t in_cmd_disable: 1;
        uint32_t reserved_26: 6;
    };
    uint32_t val;
} h264_dma_in_conf0_ch5_reg_t;

/** Type of in_pop_ch5 register
 *  RX CH5 INFIFO pop register
 */
typedef union {
    struct {
        /** infifo_rdata : RO; bitpos: [10:0]; default: 1024;
         *  This register stores the data popping from DMA Rx FIFO.
         */
        uint32_t infifo_rdata: 11;
        /** infifo_pop : R/W/SC; bitpos: [11]; default: 0;
         *  Set this bit to pop data from DMA Rx FIFO.
         */
        uint32_t infifo_pop: 1;
        uint32_t reserved_12: 20;
    };
    uint32_t val;
} h264_dma_in_pop_ch5_reg_t;

/** Type of rst_conf register
 *  axi reset config register
 */
typedef union {
    struct {
        /** inter_axim_rd_rst : R/W; bitpos: [0]; default: 0;
         *  Write 1 then write 0  to this bit to reset axi master read data FIFO.
         */
        uint32_t inter_axim_rd_rst: 1;
        /** inter_axim_wr_rst : R/W; bitpos: [1]; default: 0;
         *  Write 1 then write 0  to this bit to reset axi master write data FIFO.
         */
        uint32_t inter_axim_wr_rst: 1;
        /** exter_axim_rd_rst : R/W; bitpos: [2]; default: 0;
         *  Write 1 then write 0  to this bit to reset axi master read data FIFO.
         */
        uint32_t exter_axim_rd_rst: 1;
        /** exter_axim_wr_rst : R/W; bitpos: [3]; default: 0;
         *  Write 1 then write 0  to this bit to reset axi master write data FIFO.
         */
        uint32_t exter_axim_wr_rst: 1;
        /** clk_en : R/W; bitpos: [4]; default: 0;
         *  1'h1: Force clock on for register. 1'h0: Support clock only when application writes
         *  registers.
         */
        uint32_t clk_en: 1;
        uint32_t reserved_5: 27;
    };
    uint32_t val;
} h264_dma_rst_conf_reg_t;


/** Type of out_int_raw register
 *  TX CHn  interrupt raw register
 */
typedef union {
    struct {
        /** done_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one outlink
         *  descriptor has been transmitted to peripherals for Tx channel 0.
         */
        uint32_t done_int_raw: 1;
        /** eof_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one outlink
         *  descriptor has been read from memory for Tx channel 0.
         */
        uint32_t eof_int_raw: 1;
        /** dscr_err_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit turns to high level when detecting outlink descriptor error,
         *  including owner error, the second and third word error of outlink descriptor for Tx
         *  channel 0.
         */
        uint32_t dscr_err_int_raw: 1;
        /** total_eof_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit turns to high level when data corresponding a outlink
         *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
         *  channel 0.
         */
        uint32_t total_eof_int_raw: 1;
        /** outfifo_ovf_l1_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is overflow.
         */
        uint32_t outfifo_ovf_l1_int_raw: 1;
        /** outfifo_udf_l1_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is underflow.
         */
        uint32_t outfifo_udf_l1_int_raw: 1;
        /** outfifo_ovf_l2_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is overflow.
         */
        uint32_t outfifo_ovf_l2_int_raw: 1;
        /** outfifo_udf_l2_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is underflow.
         */
        uint32_t outfifo_udf_l2_int_raw: 1;
        /** dscr_task_ovf_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
         */
        uint32_t dscr_task_ovf_int_raw: 1;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} h264_dma_out_int_raw_chn_reg_t;

/** Type of out_int_ena register
 *  TX CHn  interrupt ena register
 */
typedef union {
    struct {
        /** done_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
         */
        uint32_t done_int_ena: 1;
        /** eof_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
         */
        uint32_t eof_int_ena: 1;
        /** dscr_err_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t dscr_err_int_ena: 1;
        /** total_eof_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t total_eof_int_ena: 1;
        /** outfifo_ovf_l1_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l1_int_ena: 1;
        /** outfifo_udf_l1_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l1_int_ena: 1;
        /** outfifo_ovf_l2_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l2_int_ena: 1;
        /** outfifo_udf_l2_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l2_int_ena: 1;
        /** dscr_task_ovf_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t dscr_task_ovf_int_ena: 1;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} h264_dma_out_int_ena_chn_reg_t;

/** Type of out_int_st register
 *  TX CHn  interrupt st register
 */
typedef union {
    struct {
        /** done_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
         */
        uint32_t done_int_st: 1;
        /** eof_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
         */
        uint32_t eof_int_st: 1;
        /** dscr_err_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t dscr_err_int_st: 1;
        /** total_eof_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t total_eof_int_st: 1;
        /** outfifo_ovf_l1_int_st : RO; bitpos: [4]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l1_int_st: 1;
        /** outfifo_udf_l1_int_st : RO; bitpos: [5]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l1_int_st: 1;
        /** outfifo_ovf_l2_int_st : RO; bitpos: [6]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l2_int_st: 1;
        /** outfifo_udf_l2_int_st : RO; bitpos: [7]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l2_int_st: 1;
        /** dscr_task_ovf_int_st : RO; bitpos: [8]; default: 0;
         *  The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t dscr_task_ovf_int_st: 1;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} h264_dma_out_int_st_chn_reg_t;

/** Type of out_int_clr register
 *  TX CHn  interrupt clr register
 */
typedef union {
    struct {
        /** done_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
         */
        uint32_t done_int_clr: 1;
        /** eof_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
         */
        uint32_t eof_int_clr: 1;
        /** dscr_err_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t dscr_err_int_clr: 1;
        /** total_eof_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t total_eof_int_clr: 1;
        /** outfifo_ovf_l1_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l1_int_clr: 1;
        /** outfifo_udf_l1_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l1_int_clr: 1;
        /** outfifo_ovf_l2_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l2_int_clr: 1;
        /** outfifo_udf_l2_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l2_int_clr: 1;
        /** dscr_task_ovf_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t dscr_task_ovf_int_clr: 1;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} h264_dma_out_int_clr_chn_reg_t;


/** Type of in_int_raw register
 *  RX CH0  interrupt raw register
 */
typedef union {
    struct {
        /** in_done_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been transmitted to peripherals for Rx channel 0.
         */
        uint32_t in_done_int_raw: 1;
        /** in_suc_eof_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been received and no data error is detected for Rx channel 0.
         */
        uint32_t in_suc_eof_int_raw: 1;
        /** in_err_eof_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been received and data error is detected
         */
        uint32_t in_err_eof_int_raw: 1;
        /** in_dscr_err_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit turns to high level when detecting inlink descriptor error,
         *  including owner error, the second and third word error of inlink descriptor for Rx
         *  channel 0.
         */
        uint32_t in_dscr_err_int_raw: 1;
        /** infifo_ovf_l1_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
         */
        uint32_t infifo_ovf_l1_int_raw: 1;
        /** infifo_udf_l1_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t infifo_udf_l1_int_raw: 1;
        /** infifo_ovf_l2_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
         */
        uint32_t infifo_ovf_l2_int_raw: 1;
        /** infifo_udf_l2_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t infifo_udf_l2_int_raw: 1;
        /** in_dscr_empty_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit turns to high level when the last descriptor is done but fifo
         *  also remain data.
         */
        uint32_t in_dscr_empty_int_raw: 1;
        /** in_dscr_task_ovf_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
         */
        uint32_t in_dscr_task_ovf_int_raw: 1;
        uint32_t reserved_10: 22;
    };
    uint32_t val;
} h264_dma_in_int_raw_chn_reg_t;

/** Type of in_int_ena register
 *  RX CH0  interrupt ena register
 */
typedef union {
    struct {
        /** in_done_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_int_ena: 1;
        /** in_suc_eof_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_int_ena: 1;
        /** in_err_eof_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_int_ena: 1;
        /** in_dscr_err_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_int_ena: 1;
        /** infifo_ovf_l1_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_int_ena: 1;
        /** infifo_udf_l1_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_int_ena: 1;
        /** infifo_ovf_l2_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l2_int_ena: 1;
        /** infifo_udf_l2_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_udf_l2_int_ena: 1;
        /** in_dscr_empty_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_int_ena: 1;
        /** in_dscr_task_ovf_int_ena : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t in_dscr_task_ovf_int_ena: 1;
        uint32_t reserved_10: 22;
    };
    uint32_t val;
} h264_dma_in_int_ena_chn_reg_t;

