espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_dma_struct.h
/** Type of in_int_st register
 *  RX CH0  interrupt st register
 */
typedef union {
    struct {
        /** in_done_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_int_st: 1;
        /** in_suc_eof_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_int_st: 1;
        /** in_err_eof_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_int_st: 1;
        /** in_dscr_err_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_int_st: 1;
        /** infifo_ovf_l1_int_st : RO; bitpos: [4]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_int_st: 1;
        /** infifo_udf_l1_int_st : RO; bitpos: [5]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_int_st: 1;
        /** infifo_ovf_l2_int_st : RO; bitpos: [6]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l2_int_st: 1;
        /** infifo_udf_l2_int_st : RO; bitpos: [7]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_udf_l2_int_st: 1;
        /** in_dscr_empty_int_st : RO; bitpos: [8]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_int_st: 1;
        /** in_dscr_task_ovf_int_st : RO; bitpos: [9]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t in_dscr_task_ovf_int_st: 1;
        uint32_t reserved_10: 22;
    };
    uint32_t val;
} h264_dma_in_int_st_chn_reg_t;

/** Type of in_int_clr register
 *  RX CH0  interrupt clr register
 */
typedef union {
    struct {
        /** in_done_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_int_clr: 1;
        /** in_suc_eof_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_int_clr: 1;
        /** in_err_eof_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_int_clr: 1;
        /** in_dscr_err_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the INDSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_int_clr: 1;
        /** infifo_ovf_l1_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_int_clr: 1;
        /** infifo_udf_l1_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_int_clr: 1;
        /** infifo_ovf_l2_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l2_int_clr: 1;
        /** infifo_udf_l2_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_udf_l2_int_clr: 1;
        /** in_dscr_empty_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_int_clr: 1;
        /** in_dscr_task_ovf_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t in_dscr_task_ovf_int_clr: 1;
        uint32_t reserved_10: 22;
    };
    uint32_t val;
} h264_dma_in_int_clr_chn_reg_t;


/** Type of in_int_raw_ch5 register
 *  RX CH5  interrupt raw register
 */
typedef union {
    struct {
        /** in_done_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been transmitted to peripherals for Rx channel 1.
         */
        uint32_t in_done_int_raw: 1;
        /** in_suc_eof_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been received and no data error is detected for Rx channel 1.
         */
        uint32_t in_suc_eof_int_raw: 1;
        /** infifo_ovf_l1_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  This raw interrupt bit turns to high level when fifo of Rx channel is overflow.
         */
        uint32_t infifo_ovf_l1_int_raw: 1;
        /** infifo_udf_l1_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t infifo_udf_l1_int_raw: 1;
        /** fetch_mb_col_cnt_ovf_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t fetch_mb_col_cnt_ovf_int_raw: 1;
        uint32_t reserved_5: 27;
    };
    uint32_t val;
} h264_dma_in_int_raw_ch5_reg_t;

/** Type of in_int_ena_ch5 register
 *  RX CH5  interrupt ena register
 */
typedef union {
    struct {
        /** in_done_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_int_ena: 1;
        /** in_suc_eof_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_int_ena: 1;
        /** infifo_ovf_l1_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_int_ena: 1;
        /** infifo_udf_l1_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_int_ena: 1;
        /** fetch_mb_col_cnt_ovf_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t fetch_mb_col_cnt_ovf_int_ena: 1;
        uint32_t reserved_5: 27;
    };
    uint32_t val;
} h264_dma_in_int_ena_ch5_reg_t;

/** Type of in_int_st_ch5 register
 *  RX CH5  interrupt st register
 */
typedef union {
    struct {
        /** in_done_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_int_st: 1;
        /** in_suc_eof_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_int_st: 1;
        /** infifo_ovf_l1_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_int_st: 1;
        /** infifo_udf_l1_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_int_st: 1;
        /** fetch_mb_col_cnt_ovf_int_st : RO; bitpos: [4]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t fetch_mb_col_cnt_ovf_int_st: 1;
        uint32_t reserved_5: 27;
    };
    uint32_t val;
} h264_dma_in_int_st_ch5_reg_t;

/** Type of in_int_clr_ch5 register
 *  RX CH5  interrupt clr register
 */
typedef union {
    struct {
        /** in_done_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_int_clr: 1;
        /** in_suc_eof_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_int_clr: 1;
        /** infifo_ovf_l1_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_int_clr: 1;
        /** infifo_udf_l1_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_int_clr: 1;
        /** fetch_mb_col_cnt_ovf_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t fetch_mb_col_cnt_ovf_int_clr: 1;
        uint32_t reserved_5: 27;
    };
    uint32_t val;
} h264_dma_in_int_clr_ch5_reg_t;


/** Type of outfifo_status register
 *  TX CHn outfifo status register
 */
typedef union {
    struct {
        /** outfifo_full_l2 : RO; bitpos: [0]; default: 0;
         *  Tx FIFO full signal for Tx channel 2.
         */
        uint32_t outfifo_full_l2: 1;
        /** outfifo_empty_l2 : RO; bitpos: [1]; default: 1;
         *  Tx FIFO empty signal for Tx channel 2.
         */
        uint32_t outfifo_empty_l2: 1;
        /** outfifo_cnt_l2 : RO; bitpos: [5:2]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 2.
         */
        uint32_t outfifo_cnt_l2: 4;
        /** outfifo_full_l1 : RO; bitpos: [6]; default: 0;
         *  Tx FIFO full signal for Tx channel 2.
         */
        uint32_t outfifo_full_l1: 1;
        /** outfifo_empty_l1 : RO; bitpos: [7]; default: 1;
         *  Tx FIFO empty signal for Tx channel 2.
         */
        uint32_t outfifo_empty_l1: 1;
        /** outfifo_cnt_l1 : RO; bitpos: [12:8]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 2.
         */
        uint32_t outfifo_cnt_l1: 5;
        uint32_t reserved_13: 3;
        /** outfifo_full_l3 : RO; bitpos: [16]; default: 0;
         *  Tx FIFO full signal for Tx channel 2.
         */
        uint32_t outfifo_full_l3: 1;
        /** outfifo_empty_l3 : RO; bitpos: [17]; default: 1;
         *  Tx FIFO empty signal for Tx channel 2.
         */
        uint32_t outfifo_empty_l3: 1;
        /** outfifo_cnt_l3 : RO; bitpos: [19:18]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 2.
         */
        uint32_t outfifo_cnt_l3: 2;
        uint32_t reserved_20: 12;
    };
    uint32_t val;
} h264_dma_outfifo_status_reg_t;

/** Type of out_state register
 *  TX CHn state register
 */
typedef union {
    struct {
        /** outlink_dscr_addr : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current outlink descriptor's address.
         */
        uint32_t outlink_dscr_addr: 18;
        /** out_dscr_state : RO; bitpos: [19:18]; default: 0;
         *  This register stores the current descriptor state machine state.
         */
        uint32_t out_dscr_state: 2;
        /** out_state : RO; bitpos: [23:20]; default: 0;
         *  This register stores the current control module state machine state.
         */
        uint32_t out_state: 4;
        /** out_reset_avail : RO; bitpos: [24]; default: 1;
         *  This register indicate that if the channel reset is safety.
         */
        uint32_t out_reset_avail: 1;
        uint32_t reserved_25: 7;
    };
    uint32_t val;
} h264_dma_out_state_chn_reg_t;

