espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_dma_struct.h
/** Type of out_eof_des_addr register
 *  TX CHn eof des addr register
 */
typedef union {
    struct {
        /** out_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr: 32;
    };
    uint32_t val;
} h264_dma_out_eof_des_addr_chn_reg_t;

/** Type of out_dscr register
 *  TX CHn next dscr addr register
 */
typedef union {
    struct {
        /** outlink_dscr : RO; bitpos: [31:0]; default: 0;
         *  The address of the next outlink descriptor address y.
         */
        uint32_t outlink_dscr: 32;
    };
    uint32_t val;
} h264_dma_out_dscr_chn_reg_t;

/** Type of out_dscr_bf0 register
 *  TX CHn last dscr addr register
 */
typedef union {
    struct {
        /** outlink_dscr_bf0 : RO; bitpos: [31:0]; default: 0;
         *  The address of the last outlink descriptor's next address y-1.
         */
        uint32_t outlink_dscr_bf0: 32;
    };
    uint32_t val;
} h264_dma_out_dscr_bf0_chn_reg_t;

/** Type of out_dscr_bf1 register
 *  TX CHn second-to-last dscr addr register
 */
typedef union {
    struct {
        /** outlink_dscr_bf1 : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last outlink descriptor's next address y-2.
         */
        uint32_t outlink_dscr_bf1: 32;
    };
    uint32_t val;
} h264_dma_out_dscr_bf1_chn_reg_t;

/** Type of infifo_status register
 *  RX CH0 INFIFO status register
 */
typedef union {
    struct {
        /** infifo_full_l2 : RO; bitpos: [0]; default: 0;
         *  Rx FIFO full signal for Rx channel.
         */
        uint32_t infifo_full_l2: 1;
        /** infifo_empty_l2 : RO; bitpos: [1]; default: 1;
         *  Rx FIFO empty signal for Rx channel.
         */
        uint32_t infifo_empty_l2: 1;
        /** infifo_cnt_l2 : RO; bitpos: [5:2]; default: 0;
         *  The register stores the byte number of the data in Rx FIFO for Rx channel.
         */
        uint32_t infifo_cnt_l2: 4;
        /** infifo_full_l1 : RO; bitpos: [6]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t infifo_full_l1: 1;
        /** infifo_empty_l1 : RO; bitpos: [7]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t infifo_empty_l1: 1;
        /** infifo_cnt_l1 : RO; bitpos: [12:8]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t infifo_cnt_l1: 5;
        uint32_t reserved_13: 3;
        /** infifo_full_l3 : RO; bitpos: [16]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t infifo_full_l3: 1;
        /** infifo_empty_l3 : RO; bitpos: [17]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t infifo_empty_l3: 1;
        /** infifo_cnt_l3 : RO; bitpos: [19:18]; default: 0;
         *  The register stores the 8byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t infifo_cnt_l3: 2;
        uint32_t reserved_20: 12;
    };
    uint32_t val;
} h264_dma_infifo_status_chn_reg_t;

/** Type of in_state register
 *  RX CH0 state register
 */
typedef union {
    struct {
        /** inlink_dscr_addr : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current inlink descriptor's address.
         */
        uint32_t inlink_dscr_addr: 18;
        /** in_dscr_state : RO; bitpos: [19:18]; default: 0;
         *  This register stores the current descriptor state machine state.
         */
        uint32_t in_dscr_state: 2;
        /** in_state : RO; bitpos: [22:20]; default: 0;
         *  This register stores the current control module state machine state.
         */
        uint32_t in_state: 3;
        /** in_reset_avail : RO; bitpos: [23]; default: 1;
         *  This register indicate that if the channel reset is safety.
         */
        uint32_t in_reset_avail: 1;
        uint32_t reserved_24: 8;
    };
    uint32_t val;
} h264_dma_in_state_chn_reg_t;

/** Type of in_suc_eof_des_addr register
 *  RX CH0 eof des addr register
 */
typedef union {
    struct {
        /** in_suc_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t in_suc_eof_des_addr: 32;
    };
    uint32_t val;
} h264_dma_in_suc_eof_des_addr_chn_reg_t;

/** Type of in_err_eof_des_addr register
 *  RX CH0 err eof des addr register
 */
typedef union {
    struct {
        /** in_err_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when there are some
         *  errors in current receiving data.
         */
        uint32_t in_err_eof_des_addr: 32;
    };
    uint32_t val;
} h264_dma_in_err_eof_des_addr_chn_reg_t;

/** Type of in_dscr register
 *  RX CH0 next dscr addr register
 */
typedef union {
    struct {
        /** inlink_dscr : RO; bitpos: [31:0]; default: 0;
         *  The address of the next inlink descriptor address x.
         */
        uint32_t inlink_dscr: 32;
    };
    uint32_t val;
} h264_dma_in_dscr_chn_reg_t;

/** Type of in_dscr_bf0 register
 *  RX CH0 last dscr addr register
 */
typedef union {
    struct {
        /** inlink_dscr_bf0 : RO; bitpos: [31:0]; default: 0;
         *  The address of the last inlink descriptor's next address x-1.
         */
        uint32_t inlink_dscr_bf0: 32;
    };
    uint32_t val;
} h264_dma_in_dscr_bf0_chn_reg_t;

/** Type of in_dscr_bf1 register
 *  RX CH0 second-to-last dscr addr register
 */
typedef union {
    struct {
        /** inlink_dscr_bf1 : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last inlink descriptor's next address x-2.
         */
        uint32_t inlink_dscr_bf1: 32;
    };
    uint32_t val;
} h264_dma_in_dscr_bf1_chn_reg_t;


