espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_dma_struct.h
/** Type of infifo_status_ch5 register
 *  RX CH5 INFIFO status register
 */
typedef union {
    struct {
        /** infifo_full_l1 : RO; bitpos: [0]; default: 0;
         *  Tx FIFO full signal for Tx channel 1.
         */
        uint32_t infifo_full_l1: 1;
        /** infifo_empty_l1 : RO; bitpos: [1]; default: 1;
         *  Tx FIFO empty signal for Tx channel 1.
         */
        uint32_t infifo_empty_l1: 1;
        /** infifo_cnt_l1 : RO; bitpos: [6:2]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 1.
         */
        uint32_t infifo_cnt_l1: 5;
        uint32_t reserved_7: 25;
    };
    uint32_t val;
} h264_dma_infifo_status_ch5_reg_t;

/** Type of in_state_ch5 register
 *  RX CH5 state register
 */
typedef union {
    struct {
        /** in_state : RO; bitpos: [2:0]; default: 0;
         *  This register stores the current control module state machine state.
         */
        uint32_t in_state: 3;
        /** in_reset_avail : RO; bitpos: [3]; default: 1;
         *  This register indicate that if the channel reset is safety.
         */
        uint32_t in_reset_avail: 1;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} h264_dma_in_state_ch5_reg_t;

/** Group: TX CHn config0 register */
/** Type of out_conf0 register
 *  TX CHn config0 register
 */
typedef union {
    struct {
        /** out_auto_wrback : R/W; bitpos: [0]; default: 0;
         *  Set this bit to enable automatic outlink-writeback when all the data pointed by
         *  outlink descriptor has been received.
         */
        uint32_t out_auto_wrback: 1;
        /** out_eof_mode : R/W; bitpos: [1]; default: 1;
         *  EOF flag generation mode when receiving data. 1: EOF flag for Tx channel 0 is
         *  generated when data need to read has been popped from FIFO in DMA
         */
        uint32_t out_eof_mode: 1;
        /** outdscr_burst_en_ch3 : R/W; bitpos: [2]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link
         *  descriptor when accessing internal SRAM.
         */
        uint32_t outdscr_burst_en_ch3: 1;
        /** out_ecc_aes_en : R/W; bitpos: [3]; default: 0;
         *  When access address space is ecc/aes area, this bit should be set to 1. In this
         *  case, the start address of square should be 16-bit aligned. The width of square
         *  multiply byte number of one pixel should be 16-bit aligned.
         */
        uint32_t out_ecc_aes_en: 1;
        /** out_check_owner : R/W; bitpos: [4]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t out_check_owner: 1;
        uint32_t reserved_5: 1;
        /** out_mem_burst_length : R/W; bitpos: [8:6]; default: 0;
         *  Block size of Tx channel 3. 0: single      1: 16 bytes      2: 32 bytes    3: 64
         *  bytes    4: 128 bytes
         */
        uint32_t out_mem_burst_length: 3;
        uint32_t reserved_9: 3;
        /** out_page_bound_en : R/W; bitpos: [12]; default: 0;
         *  Set this bit to 1 to make sure AXI read data don't cross the address boundary which
         *  define by mem_burst_length
         */
        uint32_t out_page_bound_en: 1;
        uint32_t reserved_13: 3;
        /** out_reorder_en : R/W; bitpos: [16]; default: 0;
         *  Enable TX channel 0 macro block reorder when set to 1, only channel0 have this
         *  selection
         */
        uint32_t out_reorder_en: 1;
        uint32_t reserved_17: 7;
        /** out_rst : R/W; bitpos: [24]; default: 0;
         *  Write 1 then write 0 to this bit to reset TX channel
         */
        uint32_t out_rst: 1;
        /** out_cmd_disable : R/W; bitpos: [25]; default: 0;
         *  Write 1 before reset and write 0 after reset
         */
        uint32_t out_cmd_disable: 1;
        /** out_arb_weight_opt_dis : R/W; bitpos: [26]; default: 0;
         *  Set this bit to 1 to disable arbiter optimum weight function.
         */
        uint32_t out_arb_weight_opt_dis: 1;
        uint32_t reserved_27: 5;
    };
    uint32_t val;
} h264_dma_out_conf0_chn_reg_t;


/** Group: TX CHn out_link dscr addr register */
/** Type of out_link_addr register
 *  TX CHn out_link dscr addr register
 */
typedef union {
    struct {
        /** outlink_addr : R/W; bitpos: [31:0]; default: 0;
         *  This register stores the first outlink descriptor's address.
         */
        uint32_t outlink_addr: 32;
    };
    uint32_t val;
} h264_dma_out_link_addr_chn_reg_t;


/** Group: TX CHn arb register */
/** Type of out_arb register
 *  TX CHn arb register
 */
typedef union {
    struct {
        /** out_arb_token_num : R/W; bitpos: [3:0]; default: 1;
         *  Set the max number of token count of arbiter
         */
        uint32_t out_arb_token_num: 4;
        /** exter_out_arb_priority : R/W; bitpos: [5:4]; default: 1;
         *  Set the priority of channel
         */
        uint32_t exter_out_arb_priority: 2;
        uint32_t reserved_6: 26;
    };
    uint32_t val;
} h264_dma_out_arb_chn_reg_t;


/** Group: TX CHn ETM config register */
/** Type of out_etm_conf register
 *  TX CHn ETM config register
 */
typedef union {
    struct {
        /** out_etm_en : R/W; bitpos: [0]; default: 0;
         *  Set this bit to 1 to enable ETM task function
         */
        uint32_t out_etm_en: 1;
        /** out_etm_loop_en : R/W; bitpos: [1]; default: 0;
         *  when this bit is 1, dscr can be processed after receiving a task
         */
        uint32_t out_etm_loop_en: 1;
        /** out_dscr_task_mak : R/W; bitpos: [3:2]; default: 1;
         *  ETM dscr_ready maximum cache numbers
         */
        uint32_t out_dscr_task_mak: 2;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} h264_dma_out_etm_conf_chn_reg_t;


/** Group: TX CHn debug info */
/** Type of out_buf_len register
 *  tx CHn buf len register
 */
typedef union {
    struct {
        /** out_cmdfifo_buf_len_hb : RO; bitpos: [12:0]; default: 0;
         *  only for debug
         */
        uint32_t out_cmdfifo_buf_len_hb: 28;
        uint32_t reserved_13: 4;
    };
    uint32_t val;
} h264_dma_out_buf_len_chn_reg_t;

/** Type of out_fifo_bcnt register
 *  tx CHn fifo byte cnt register
 */
typedef union {
    struct {
        /** out_cmdfifo_outfifo_bcnt : RO; bitpos: [9:0]; default: 0;
         *  only for debug
         */
        uint32_t out_cmdfifo_outfifo_bcnt: 10;
        uint32_t reserved_10: 22;
    };
    uint32_t val;
} h264_dma_out_fifo_bcnt_chn_reg_t;

/** Type of out_push_bytecnt register
 *  tx CHn push byte cnt register
 */
typedef union {
    struct {
        /** out_cmdfifo_push_bytecnt : RO; bitpos: [7:0]; default: 63;
         *  only for debug
         */
        uint32_t out_cmdfifo_push_bytecnt: 8;
        uint32_t reserved_8: 24;
    };
    uint32_t val;
} h264_dma_out_push_bytecnt_chn_reg_t;

/** Type of out_xaddr register
 *  tx CHn xaddr register
 */
typedef union {
    struct {
        /** out_cmdfifo_xaddr : RO; bitpos: [31:0]; default: 0;
         *  only for debug
         */
        uint32_t out_cmdfifo_xaddr: 32;
    };
    uint32_t val;
} h264_dma_out_xaddr_chn_reg_t;

/** Type of out_block_buf_len register
 *  tx CHn block buf len register
 */
typedef union {
    struct {
        /** out_block_buf_len : RO; bitpos: [27:0]; default: 0;
         *  only for debug
         */
        uint32_t out_block_buf_len: 28;
        uint32_t reserved_28: 4;
    };
    uint32_t val;
} h264_dma_out_block_buf_len_chn_reg_t;


/** Group: RX CH0 in_link dscr addr register */
/** Type of in_link_addr register
 *  RX CH0 in_link dscr addr register
 */
typedef union {
    struct {
        /** inlink_addr : R/W; bitpos: [31:0]; default: 0;
         *  This register stores the first inlink descriptor's address.
         */
        uint32_t inlink_addr: 32;
    };
    uint32_t val;
} h264_dma_in_link_addr_chn_reg_t;


/** Group: RX CH0 arb register */
/** Type of in_arb register
 *  RX CH0 arb register
 */
typedef union {
    struct {
        /** in_arb_token_num : R/W; bitpos: [3:0]; default: 1;
         *  Set the max number of token count of arbiter
         */
        uint32_t in_arb_token_num: 4;
        /** exter_in_arb_priority : R/W; bitpos: [5:4]; default: 1;
         *  Set the priority of channel
         */
        uint32_t exter_in_arb_priority: 2;
        /** inter_in_arb_priority : R/W; bitpos: [8:6]; default: 1;
         *  Set the priority of channel
         */
        uint32_t inter_in_arb_priority: 3;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} h264_dma_in_arb_chn_reg_t;


