espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_dma_struct.h
/** Group: RX CH0 ETM config register */
/** Type of in_etm_conf register
 *  RX CH0 ETM config register
 */
typedef union {
    struct {
        /** in_etm_en : R/W; bitpos: [0]; default: 0;
         *  Set this bit to 1 to enable ETM task function
         */
        uint32_t in_etm_en: 1;
        /** in_etm_loop_en : R/W; bitpos: [1]; default: 0;
         *  when this bit is 1, dscr can be processed after receiving a task
         */
        uint32_t in_etm_loop_en: 1;
        /** in_dscr_task_mak : R/W; bitpos: [3:2]; default: 1;
         *  ETM dscr_ready maximum cache numbers
         */
        uint32_t in_dscr_task_mak: 2;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} h264_dma_in_etm_conf_chn_reg_t;


/** Group: RX CH0 debug info */
/** Type of in_fifo_cnt register
 *  rx CH0 fifo cnt register
 */
typedef union {
    struct {
        /** in_cmdfifo_infifo_cnt : RO; bitpos: [9:0]; default: 0;
         *  only for debug
         */
        uint32_t in_cmdfifo_infifo_cnt: 10;
        uint32_t reserved_10: 22;
    };
    uint32_t val;
} h264_dma_in_fifo_cnt_chn_reg_t;

/** Type of in_pop_data_cnt register
 *  rx CH0 pop data cnt register
 */
typedef union {
    struct {
        /** in_cmdfifo_pop_data_cnt : RO; bitpos: [7:0]; default: 7;
         *  only for debug
         */
        uint32_t in_cmdfifo_pop_data_cnt: 8;
        uint32_t reserved_8: 24;
    };
    uint32_t val;
} h264_dma_in_pop_data_cnt_chn_reg_t;

/** Type of in_xaddr register
 *  rx CH0 xaddr register
 */
typedef union {
    struct {
        /** in_cmdfifo_xaddr : RO; bitpos: [31:0]; default: 0;
         *  only for debug
         */
        uint32_t in_cmdfifo_xaddr: 32;
    };
    uint32_t val;
} h264_dma_in_xaddr_chn_reg_t;

/** Type of in_buf_hb_rcv register
 *  rx CH0 buf len hb rcv register
 */
typedef union {
    struct {
        /** in_cmdfifo_buf_hb_rcv : RO; bitpos: [28:0]; default: 0;
         *  only for debug
         */
        uint32_t in_cmdfifo_buf_hb_rcv: 29;
        uint32_t reserved_29: 3;
    };
    uint32_t val;
} h264_dma_in_buf_hb_rcv_chn_reg_t;

/** Group: RX CH5 config1 register */
/** Type of in_conf1_ch5 register
 *  RX CH5 config1 register
 */
typedef union {
    struct {
        /** block_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  RX Channel 5 destination start address
         */
        uint32_t block_start_addr: 32;
    };
    uint32_t val;
} h264_dma_in_conf1_ch5_reg_t;


/** Group: RX CH5 config2 register */
/** Type of in_conf2_ch5 register
 *  RX CH5 config2 register
 */
typedef union {
    struct {
        /** block_row_length_12line : R/W; bitpos: [15:0]; default: 30720;
         *  The number of bytes contained in a row block 12line in RX channel 5
         */
        uint32_t block_row_length_12line: 16;
        /** block_row_length_4line : R/W; bitpos: [31:16]; default: 15360;
         *  The number of bytes contained in a row block 4line in RX channel 5
         */
        uint32_t block_row_length_4line: 16;
    };
    uint32_t val;
} h264_dma_in_conf2_ch5_reg_t;


/** Group: RX CH5 config3 register */
/** Type of in_conf3_ch5 register
 *  RX CH5 config3 register
 */
typedef union {
    struct {
        /** block_length_12line : R/W; bitpos: [13:0]; default: 256;
         *  The number of bytes contained in a block 12line
         */
        uint32_t block_length_12line: 14;
        /** block_length_4line : R/W; bitpos: [27:14]; default: 128;
         *  The number of bytes contained in a block 4line
         */
        uint32_t block_length_4line: 14;
        uint32_t reserved_28: 4;
    };
    uint32_t val;
} h264_dma_in_conf3_ch5_reg_t;


/** Group: RX CH5 arb register */
/** Type of in_arb_ch5 register
 *  RX CH5 arb register
 */
typedef union {
    struct {
        /** in_arb_token_num : R/W; bitpos: [3:0]; default: 1;
         *  Set the max number of token count of arbiter
         */
        uint32_t in_arb_token_num: 4;
        uint32_t reserved_4: 2;
        /** inter_in_arb_priority : R/W; bitpos: [8:6]; default: 1;
         *  Set the priority of channel
         */
        uint32_t inter_in_arb_priority: 3;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} h264_dma_in_arb_ch5_reg_t;


/** Group: RX CH5 debug info */
/** Type of in_fifo_cnt_ch5 register
 *  rx CH5 fifo cnt register
 */
typedef union {
    struct {
        /** in_cmdfifo_infifo_cnt : RO; bitpos: [9:0]; default: 0;
         *  only for debug
         */
        uint32_t in_cmdfifo_infifo_cnt: 10;
        uint32_t reserved_10: 22;
    };
    uint32_t val;
} h264_dma_in_fifo_cnt_ch5_reg_t;

/** Type of in_pop_data_cnt_ch5 register
 *  rx CH5 pop data cnt register
 */
typedef union {
    struct {
        /** in_cmdfifo_pop_data_cnt : RO; bitpos: [7:0]; default: 255;
         *  only for debug
         */
        uint32_t in_cmdfifo_pop_data_cnt: 8;
        uint32_t reserved_8: 24;
    };
    uint32_t val;
} h264_dma_in_pop_data_cnt_ch5_reg_t;

/** Type of in_xaddr_ch5 register
 *  rx CH5 xaddr register
 */
typedef union {
    struct {
        /** in_cmdfifo_xaddr : RO; bitpos: [31:0]; default: 0;
         *  only for debug
         */
        uint32_t in_cmdfifo_xaddr: 32;
    };
    uint32_t val;
} h264_dma_in_xaddr_ch5_reg_t;

/** Type of in_buf_hb_rcv_ch5 register
 *  rx CH5 buf len hb rcv register
 */
typedef union {
    struct {
        /** in_cmdfifo_buf_hb_rcv : RO; bitpos: [28:0]; default: 0;
         *  only for debug
         */
        uint32_t in_cmdfifo_buf_hb_rcv: 29;
        uint32_t reserved_29: 3;
    };
    uint32_t val;
} h264_dma_in_buf_hb_rcv_ch5_reg_t;


/** Group: inter axi err */
/** Type of inter_axi_err register
 *  inter memory axi err register
 */
typedef union {
    struct {
        /** inter_rid_err_cnt : RO; bitpos: [3:0]; default: 0;
         *  AXI read id err cnt
         */
        uint32_t inter_rid_err_cnt: 4;
        /** inter_rresp_err_cnt : RO; bitpos: [7:4]; default: 0;
         *  AXI read resp err cnt
         */
        uint32_t inter_rresp_err_cnt: 4;
        /** inter_wresp_err_cnt : RO; bitpos: [11:8]; default: 0;
         *  AXI write resp err cnt
         */
        uint32_t inter_wresp_err_cnt: 4;
        /** inter_rd_fifo_cnt : RO; bitpos: [14:12]; default: 0;
         *  AXI read cmd fifo remain cmd count
         */
        uint32_t inter_rd_fifo_cnt: 3;
        /** inter_rd_bak_fifo_cnt : RO; bitpos: [18:15]; default: 0;
         *  AXI read backup cmd fifo remain cmd count
         */
        uint32_t inter_rd_bak_fifo_cnt: 4;
        /** inter_wr_fifo_cnt : RO; bitpos: [21:19]; default: 0;
         *  AXI write cmd fifo remain cmd count
         */
        uint32_t inter_wr_fifo_cnt: 3;
        /** inter_wr_bak_fifo_cnt : RO; bitpos: [25:22]; default: 0;
         *  AXI write backup cmd fifo remain cmd count
         */
        uint32_t inter_wr_bak_fifo_cnt: 4;
        uint32_t reserved_26: 6;
    };
    uint32_t val;
} h264_dma_inter_axi_err_reg_t;


/** Group: exter axi err */
/** Type of exter_axi_err register
 *  exter memory axi err register
 */
typedef union {
    struct {
        /** exter_rid_err_cnt : RO; bitpos: [3:0]; default: 0;
         *  AXI read id err cnt
         */
        uint32_t exter_rid_err_cnt: 4;
        /** exter_rresp_err_cnt : RO; bitpos: [7:4]; default: 0;
         *  AXI read resp err cnt
         */
        uint32_t exter_rresp_err_cnt: 4;
        /** exter_wresp_err_cnt : RO; bitpos: [11:8]; default: 0;
         *  AXI write resp err cnt
         */
        uint32_t exter_wresp_err_cnt: 4;
        /** exter_rd_fifo_cnt : RO; bitpos: [14:12]; default: 0;
         *  AXI read cmd fifo remain cmd count
         */
        uint32_t exter_rd_fifo_cnt: 3;
        /** exter_rd_bak_fifo_cnt : RO; bitpos: [18:15]; default: 0;
         *  AXI read backup cmd fifo remain cmd count
         */
        uint32_t exter_rd_bak_fifo_cnt: 4;
        /** exter_wr_fifo_cnt : RO; bitpos: [21:19]; default: 0;
         *  AXI write cmd fifo remain cmd count
         */
        uint32_t exter_wr_fifo_cnt: 3;
        /** exter_wr_bak_fifo_cnt : RO; bitpos: [25:22]; default: 0;
         *  AXI write backup cmd fifo remain cmd count
         */
        uint32_t exter_wr_bak_fifo_cnt: 4;
        uint32_t reserved_26: 6;
    };
    uint32_t val;
} h264_dma_exter_axi_err_reg_t;


/** Group: dscr addr range register */
/** Type of mem_start_addr register
 *  Start address of inter memory range register
 */
typedef union {
    struct {
        /** access_mem_start_addr : R/W; bitpos: [31:0]; default: 806354944;
         *  The start address of accessible address space.
         */
        uint32_t access_mem_start_addr: 32;
    };
    uint32_t val;
} h264_dma_mem_start_addr_reg_t;

/** Type of mem_end_addr register
 *  end address of inter memory range register
 */
typedef union {
    struct {
        /** access_mem_end_addr : R/W; bitpos: [31:0]; default: 2415919103;
         *  The end address of accessible address space. The access address beyond this range
         *  would lead to descriptor error.
         */
        uint32_t access_mem_end_addr: 32;
    };
    uint32_t val;
} h264_dma_mem_end_addr_reg_t;

/** Group: arb config register */
/** Type of arb_config register
 *  reserved
 */
typedef union {
    struct {
        /** arb_timeout_num : R/W; bitpos: [15:0]; default: 0;
         *  Set the max number of timeout count of arbiter
         */
        uint32_t arb_timeout_num: 16;
        /** weight_en : R/W; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t weight_en: 1;
        uint32_t reserved_17: 15;
    };
    uint32_t val;
} h264_dma_arb_config_reg_t;


/** Group: date register */
/** Type of date register
 *  reserved
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 539165699;
         *  register version.
         */
        uint32_t date: 32;
    };
    uint32_t val;
} h264_dma_date_reg_t;


/** Group: counter rst register */
/** Type of counter_rst register
 *  counter reset register
 */
typedef union {
    struct {
        /** rx_ch0_exter_counter_rst : R/W; bitpos: [0]; default: 0;
         *  Write 1 then write 0 to this bit to reset rx ch0 counter.
         */
        uint32_t rx_ch0_exter_counter_rst: 1;
        /** rx_ch1_exter_counter_rst : R/W; bitpos: [1]; default: 0;
         *  Write 1 then write 0 to this bit to reset rx ch1 counter.
         */
        uint32_t rx_ch1_exter_counter_rst: 1;
        /** rx_ch2_inter_counter_rst : R/W; bitpos: [2]; default: 0;
         *  Write 1 then write 0 to this bit to reset rx ch2 counter.
         */
        uint32_t rx_ch2_inter_counter_rst: 1;
        /** rx_ch5_inter_counter_rst : R/W; bitpos: [3]; default: 0;
         *  Write 1 then write 0 to this bit to reset rx ch5 counter.
         */
        uint32_t rx_ch5_inter_counter_rst: 1;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} h264_dma_counter_rst_reg_t;


/** Group: counter register */
/** Type of rx_ch0_counter register
 *  rx ch0 counter register
 */
typedef union {
    struct {
        /** rx_ch0_cnt : RO; bitpos: [22:0]; default: 0;
         *  rx ch0 counter register
         */
        uint32_t rx_ch0_cnt: 23;
        uint32_t reserved_23: 9;
    };
    uint32_t val;
} h264_dma_rx_ch0_counter_reg_t;

