espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_dma_struct.h
/** Type of rx_ch1_counter register
 *  rx ch1 counter register
 */
typedef union {
    struct {
        /** rx_ch1_cnt : RO; bitpos: [20:0]; default: 0;
         *  rx ch1 counter register
         */
        uint32_t rx_ch1_cnt: 21;
        uint32_t reserved_21: 11;
    };
    uint32_t val;
} h264_dma_rx_ch1_counter_reg_t;

/** Type of rx_ch2_counter register
 *  rx ch2 counter register
 */
typedef union {
    struct {
        /** rx_ch2_cnt : RO; bitpos: [10:0]; default: 0;
         *  rx ch2 counter register
         */
        uint32_t rx_ch2_cnt: 11;
        uint32_t reserved_11: 21;
    };
    uint32_t val;
} h264_dma_rx_ch2_counter_reg_t;

/** Type of rx_ch5_counter register
 *  rx ch5 counter register
 */
typedef union {
    struct {
        /** rx_ch5_cnt : RO; bitpos: [16:0]; default: 0;
         *  rx ch5 counter register
         */
        uint32_t rx_ch5_cnt: 17;
        uint32_t reserved_17: 15;
    };
    uint32_t val;
} h264_dma_rx_ch5_counter_reg_t;

/** Group: pbyte register */
/** Type of pbyte register
 *  image pbyte register
 */
typedef union {
    struct {
        /** ori_pbyte : R/W; bitpos: [3:0]; default: 2;
         *  configures bytes per pixel for ori img. 0: 0.5byte/pix, 1: 1byte/pix, 2:
         *  1.5byte/pix, 3: 2byte/pix, 4: 3byte/pix
         */
        uint32_t ori_pbyte: 4;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} h264_dma_pbyte_reg_t;

typedef struct {
    volatile h264_dma_out_conf0_chn_reg_t conf0;
    volatile h264_dma_out_int_raw_chn_reg_t int_raw;
    volatile h264_dma_out_int_ena_chn_reg_t int_ena;
    volatile h264_dma_out_int_st_chn_reg_t int_st;
    volatile h264_dma_out_int_clr_chn_reg_t int_clr;
    volatile h264_dma_outfifo_status_reg_t outfifo_status;
    volatile h264_dma_out_push_chn_reg_t push;
    volatile h264_dma_out_link_conf_chn_reg_t link_conf;
    volatile h264_dma_out_link_addr_chn_reg_t link_addr;
    volatile h264_dma_out_state_chn_reg_t state;
    volatile h264_dma_out_eof_des_addr_chn_reg_t eof_des_addr;
    volatile h264_dma_out_dscr_chn_reg_t dscr;
    volatile h264_dma_out_dscr_bf0_chn_reg_t dscr_bf0;
    volatile h264_dma_out_dscr_bf1_chn_reg_t dscr_bf1;
    uint32_t reserved_338;
    volatile h264_dma_out_arb_chn_reg_t arb;
    uint32_t reserved_340[10];
    volatile h264_dma_out_etm_conf_chn_reg_t etm_conf;
    uint32_t reserved_36c;
    volatile h264_dma_out_buf_len_chn_reg_t buf_len;
    volatile h264_dma_out_fifo_bcnt_chn_reg_t fifo_bcnt;
    volatile h264_dma_out_push_bytecnt_chn_reg_t push_bytecnt;
    volatile h264_dma_out_xaddr_chn_reg_t xaddr;
    volatile h264_dma_out_block_buf_len_chn_reg_t block_buf_len;    // Please note that this reg only exists on out[3] and out[4]
    uint32_t reserved_384[31];
} h264_dma_out_chn_regs_t;

typedef struct {
    volatile h264_dma_in_conf0_chn_reg_t conf0;
    volatile h264_dma_in_int_raw_chn_reg_t int_raw;
    volatile h264_dma_in_int_ena_chn_reg_t int_ena;
    volatile h264_dma_in_int_st_chn_reg_t int_st;
    volatile h264_dma_in_int_clr_chn_reg_t int_clr;
    volatile h264_dma_infifo_status_chn_reg_t infifo_status;
    volatile h264_dma_in_pop_chn_reg_t pop;
    volatile h264_dma_in_link_conf_chn_reg_t link_conf;
    volatile h264_dma_in_link_addr_chn_reg_t link_addr;
    volatile h264_dma_in_state_chn_reg_t state;
    volatile h264_dma_in_suc_eof_des_addr_chn_reg_t suc_eof_des_addr;
    volatile h264_dma_in_err_eof_des_addr_chn_reg_t err_eof_des_addr;
    volatile h264_dma_in_dscr_chn_reg_t dscr;
    volatile h264_dma_in_dscr_bf0_chn_reg_t dscr_bf0;
    volatile h264_dma_in_dscr_bf1_chn_reg_t dscr_bf1;
    uint32_t reserved_53c;
    volatile h264_dma_in_arb_chn_reg_t arb;
    uint32_t reserved_544;
    volatile h264_dma_in_ro_pd_conf_chn_reg_t ro_pd_conf;
    uint32_t reserved_54c[8];
    volatile h264_dma_in_etm_conf_chn_reg_t etm_conf;
    uint32_t reserved_570[4];
    volatile h264_dma_in_fifo_cnt_chn_reg_t fifo_cnt;
    volatile h264_dma_in_pop_data_cnt_chn_reg_t pop_data_cnt;
    volatile h264_dma_in_xaddr_chn_reg_t xaddr;
    volatile h264_dma_in_buf_hb_rcv_chn_reg_t buf_hb_rcv;
    uint32_t reserved_590[28];
} h264_dma_in_chn_regs_t;

typedef struct {
    volatile h264_dma_in_conf0_ch5_reg_t conf0;
    volatile h264_dma_in_conf1_ch5_reg_t conf1;
    volatile h264_dma_in_conf2_ch5_reg_t conf2;
    volatile h264_dma_in_conf3_ch5_reg_t conf3;
    volatile h264_dma_in_int_raw_ch5_reg_t int_raw;
    volatile h264_dma_in_int_ena_ch5_reg_t int_ena;
    volatile h264_dma_in_int_st_ch5_reg_t int_st;
    volatile h264_dma_in_int_clr_ch5_reg_t int_clr;
    volatile h264_dma_infifo_status_ch5_reg_t infifo_status;
    volatile h264_dma_in_pop_ch5_reg_t pop;
    volatile h264_dma_in_state_ch5_reg_t state;
    uint32_t reserved_a2c[5];
    volatile h264_dma_in_arb_ch5_reg_t arb;
    uint32_t reserved_a44[15];
    volatile h264_dma_in_fifo_cnt_ch5_reg_t fifo_cnt;
    volatile h264_dma_in_pop_data_cnt_ch5_reg_t pop_data_cnt;
    volatile h264_dma_in_xaddr_ch5_reg_t xaddr;
    volatile h264_dma_in_buf_hb_rcv_ch5_reg_t buf_hb_rcv;
    uint32_t reserved_a90[28];
} h264_dma_in_ch5_regs_t;

typedef struct {
    volatile h264_dma_mem_start_addr_reg_t start;
    volatile h264_dma_mem_end_addr_reg_t end;
} h264_dma_mem_addr_reg_t;

typedef struct {
    volatile h264_dma_out_chn_regs_t dma_out_ch[5];
    volatile h264_dma_in_chn_regs_t dma_in_ch[5];
    volatile h264_dma_in_ch5_regs_t dma_in_ch5;
    volatile h264_dma_inter_axi_err_reg_t inter_axi_err;
    volatile h264_dma_exter_axi_err_reg_t exter_axi_err;
    volatile h264_dma_rst_conf_reg_t rst_conf;
    volatile h264_dma_mem_addr_reg_t inter_mem_addr[2];
    uint32_t reserved_b1c;
    volatile h264_dma_mem_addr_reg_t exter_mem_addr[2];
    volatile h264_dma_arb_config_reg_t out_arb_config;
    volatile h264_dma_arb_config_reg_t in_arb_config;
    uint32_t reserved_b38;
    volatile h264_dma_date_reg_t date;
    uint32_t reserved_b40[4];
    volatile h264_dma_counter_rst_reg_t counter_rst;
    volatile h264_dma_rx_ch0_counter_reg_t rx_ch0_counter;
    volatile h264_dma_rx_ch1_counter_reg_t rx_ch1_counter;
    volatile h264_dma_rx_ch2_counter_reg_t rx_ch2_counter;
    volatile h264_dma_rx_ch5_counter_reg_t rx_ch5_counter;
    volatile h264_dma_pbyte_reg_t pbyte;
    uint32_t debug_regs[23];
} h264_dma_dev_t;

#ifndef __cplusplus
_Static_assert(sizeof(h264_dma_dev_t) == 0xbc4, "Invalid size of h264_dma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
